IDEA Open Model
Member2D.Elements2D Property
Compatible with IDEA StatiCa v 10.1
 Array of element2D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public List<ReferenceElement> Elements2D { get; set; }
Public Property Elements2D As List(Of ReferenceElement)
	Get
	Set
public:
property List<ReferenceElement^>^ Elements2D {
	List<ReferenceElement^>^ get ();
	void set (List<ReferenceElement^>^ value);
}
Return Value
Type: List<ReferenceElement>
List of Element2D
See Also
Reference
Member2D Class
IdeaRS.OpenModel.Model Namespace